#+TITLE: Kapitel 5: Weitere Datentypen
#+INCLUDE: "../template/header.org"

#+STARTUP: showeverything
# TODO states: looks like this has to go on main file and cannot be
# included 
#+TODO: TODO(t) | UEBUNG(u) DONE(d)
#+OPTIONS: tasks:todo

*** Eine Aufzählung von drei Zahlen:				    :animate:

#+BEGIN_SRC python :exports both :results output 
t = (17, 42, 101) 
print(t)
#+END_SRC 

#+RESULTS:
: (17, 42, 101)

*** Eine Aufzählung von Zeichenketten:				    :animate:

#+BEGIN_SRC python :exports both :results output 
t = ("Hallo", "GP1", "!")
print(t) 
#+END_SRC 

#+RESULTS:
: ('Hallo', 'GP1', '!')

*** Eine gemischte Aufzählung					    :animate:

#+BEGIN_SRC python :exports both :results output 
t = ("Hallo", "GP1", 16, 17) 
print(t) 
#+END_SRC 

#+RESULTS:
: ('Hallo', 'GP1', 16, 17)

*** Beispiel 							    :animate:

#+BEGIN_SRC python :exports both :results output 
t = ("Hallo", "GP1", (1, 2, 3, 9, 8, 7) ) 
print("t[1]: ", t[1])
print("t[2]: ", t[2]) 
#+END_SRC 

#+RESULTS:
: GP1
: (1, 2, 3, 9, 8, 7)

*** Beispiel: Verkettete Subskripts				    :animate:

#+BEGIN_SRC python :exports both :results output
t = ("Hallo", "GP1", (1, 2, 3, 9, 8, 7) ) 
print(t[2][3])
#+END_SRC 

#+RESULTS:
: 9


*** Beispiel: Slicing 

#+BEGIN_SRC python :exports both :results output
t = ('a', 'b', 'c', 'd', 'e', 'f')
print(t[2:4])
#+END_SRC

#+RESULTS:
: ('c', 'd')

*** Slicing über Ende hinaus 

Kein Problem, liefert bis zum Ende 

#+BEGIN_SRC python :exports both :results output
t = ('a', 'b', 'c', 'd', 'e', 'f')
print(t[2:100])
#+END_SRC

#+RESULTS:
: ('c', 'd', 'e', 'f')

*** Slicing von rechts						    :animate:

#+BEGIN_SRC python :exports both :results output
t = ('a', 'b', 'c', 'd', 'e', 'f')
print("t[-1]: ", t[-1])
print("t[-2]: ", t[-2])
#+END_SRC

#+RESULTS:
: f
: e

**** Spezialfall:						    :animate:

#+BEGIN_SRC python :exports both :results output
t = ('a', 'b', 'c', 'd', 'e', 'f') 
print(t)   
t = t[1:]
print(t)   
t = t[1:]
print(t)  
t = t[1:]
print(t) 
#+END_SRC 

#+RESULTS:
: ('a', 'b', 'c', 'd', 'e', 'f')
: ('b', 'c', 'd', 'e', 'f')
: ('c', 'd', 'e', 'f')
: ('d', 'e', 'f')


*** Tupel mit einem Element

Komma am Ende ist entscheidend -- Unterschied zu Ausdruck! 

#+BEGIN_SRC python :exports both :results output
# Ein Tupel mit einem Element:
t = ("a",)
print("Ein Tuple: ", t)
# Ein einzelner String: 
t = ("a")
print("Ein String: ", t)
#+END_SRC 

#+RESULTS:
: Ein Tuple:  ('a',)
: Ein String:  a



** Wo ist ein Element in Tuple? 

Wo im Tupel befindet sich ein bestimmtes Element ? 
- Funktion ~index~, Parameter: gesuchtes Element 
- Gewissermaßen Umkehrung des Zugriffs


#+BEGIN_SRC python :exports both :results output
t = (-1, 0, 17, 1, 2, 3, 4, 5, 6)
l = t.index(3)
print(l)
#+END_SRC 

#+RESULTS:
: 5

** Wieviele Elemente mit bestimmtem Wert? 

#+BEGIN_SRC python :exports both :results output
t = (1, 2, 3, 4, 5, 1, 2, 3, 4, 1, 2, 3, 1, 2, 1)
n = t.count(2)
print(n)
#+END_SRC 

#+RESULTS:
: 4

Auch hier: Notation mit Tuple vor dem Funktionsnamen 


** Tuple als Funktionsparameter 

Parameter sind Referenzen auf Objekte -- also Referenz auf ein Tuple
kein Problem 

#+BEGIN_SRC python :exports both :results output
  def quersumme3(t):
      """Berechne die Quersumme aus einem 3-Tuple"""

      return t[0] + t[1] + t[2]

  # Tupel direkt als Parameter angeben: 
  q = quersumme3((17, 42, 99))
  print(q)
#+END_SRC 

#+RESULTS:
: 158

** Verknüpfungen und Funktionen à la Tuple 

#+BEGIN_SRC python :exports both :results output
L = [1, 2, 3, 1, 2]
print(L + [7, 8, 9])
print(L * 3)
# L hat sich nicht veraendert
print(L)
# Funktionen fuer Liste
print(len(L))
print(L.count(1))
print(L.index(2))
#+END_SRC 

#+RESULTS:
: [1, 2, 3, 1, 2, 7, 8, 9]
: [1, 2, 3, 1, 2, 1, 2, 3, 1, 2, 1, 2, 3, 1, 2]
: [1, 2, 3, 1, 2]
: 5
: 2
: 1


** Veränderung von Listenelementen 

Ziel war: Listenelemente verändern 

#+BEGIN_SRC python :exports both :results output
%%tutor 
L = [1, 2, 3, 1, 2]
L[1] = 42
print(L)
#+END_SRC 

#+RESULTS:
: [1, 42, 3, 1, 2]

*** Anhängen 

Gegebenen Wert an Liste anhängen 



#+BEGIN_SRC python :exports both :results output
L = [1, 2, 3]
L.append(4)
print(L)
#+END_SRC 

#+RESULTS:
: [1, 2, 3, 4]


#+BEGIN_SRC python :exports both :results output
L = [1, 2, 3]
L.append([4, 5])
print(L)
#+END_SRC 

#+RESULTS:
: [1, 2, 3, [4, 5]]


*** Erweitern 

Eine Liste mit einer anderen Liste erweitern 

#+BEGIN_SRC python :exports both :results output
L = [1, 2, 3]
L.extend([4, 5])
print(L)
#+END_SRC 

#+RESULTS:
: [1, 2, 3, 4, 5]

*** Einfügen 

*Vor* Position einen Wert einfügen: 

#+BEGIN_SRC python :exports both :results output
L = [1, 2, 3]
L.insert(1, 17)
print(L)
#+END_SRC 

#+RESULTS:
: [1, 17, 2, 3]

*** ~pop~: Element entnehmen und als Wert zurückgeben 
#+BEGIN_SRC python :exports both :results output
L = [1, 2, 3]
print("L vor pop: ", L)   
x = L.pop(0)
print("erstes Element: ", x)
print("L nach pop: ", L) 
#+END_SRC 

#+RESULTS:
: L vor pop:  [1, 2, 3]
: erstes Element:  1
: L nach pop:  [2, 3]

*** ~remove~: Erstes Auftragen eines Wertes entfernen		    :animate:

#+BEGIN_SRC python :exports both :results output
L = [1, 2, 3, 1, 2, 3]
L.remove(2)
print(L)
#+END_SRC 

#+RESULTS:
: [1, 3, 1, 2, 3]

*** UEBUNG Manipulation von Listenelementen bei kopierten Listen 




#+BEGIN_SRC python :exports both :results output
L = [1, 2, 3]
L1 = L 
L2 = L.copy()
L1[1] = 17
L2[1] = 42
print("L1: ", L1)
print("L2: ", L2)
#+END_SRC

#+RESULTS:
: L1:  [1, 17, 3]
: L2:  [1, 42, 3]





*** UEBUNG Was passiert, wenn eine Liste von Listen kopiert wird? 


Was gibt das print aus? 

#+BEGIN_SRC python :exports both :results output
L = [1, [2, 3], 4] 
L1 = L.copy()
L1[1][0] = 17
print(L) 
#+END_SRC

#+RESULTS:
: [1, [17, 3], 4]


#+BEGIN_SRC python :exports both :results output
L = [1, [17, 18, 19], 3]
L1 = L 
print(L1)
L2 = L.copy()
print(L2)
L1[1][1] = 17
print(L1)  
L2[1][1] = 42
print(L1)  
print(L2)
#+END_SRC 

#+RESULTS:
: [1, [17, 18, 19], 3]
: [1, [17, 18, 19], 3]
: [1, [17, 17, 19], 3]
: [1, [17, 42, 19], 3]
: [1, [17, 42, 19], 3]



shallow vs. deep copy!  deepcopy können wir leider noch nicht nehmen
da wir noch keine imports haben. Aber Problembewusstsein herstellen!
Das deepcopy Beispiel holen wir später nach. 


Was wird hier ausgebeben? 

#+BEGIN_SRC python
from copy import deepcopy 

L = [1, [2, 3], 4] 
L1 = L.copy()
L2 = deepcopy(L)
L1[1][0] = 17
print(L) 
L2[1][1] = 42
print(L)
#+END_SRC



*** Identisches Objekt, nur unterschiedlicher Name

#+BEGIN_SRC python :exports both :results output
L = [1, 2, 3]
L1 = L
L2 = L.copy()
print("L1 is L? ", L1 is L) 
print("L2 is L? ", L2 is L) 
#+END_SRC 

#+RESULTS:
: L1 is L?  True
: L2 is L?  False


*** Gleiche Werte enthalten 

#+BEGIN_SRC python :exports both :results output
L = [1, 2, 3]
L1 = L
L2 = L.copy()
print("L1 == L? ", L1 == L) 
print("L2 == L? ", L2 == L) 
#+END_SRC 

#+RESULTS:
: L1 == L?  True
: L2 == L?  True

** Liste als Funktionsparameter

Wie erwartet: 

#+BEGIN_SRC python :exports both :results output
  def quersumme3(t):
      """Berechne die Quersumme aus einem 3-Tuple"""

      return t[0] + t[1] + t[2]

  # Tupel direkt als Parameter angeben: 
  q = quersumme3([17, 42, 99])
  print(q)
#+END_SRC 

#+RESULTS:
: 158


** Liste als Funktionsparameter -- Veränderung? 

Wenn eine Liste veränderlich ist, dann könnte eine Funktion sie doch
auch verändern? 
- Genauer: die Inhalte der Liste 

#+BEGIN_SRC python :exports both :results output
  def modify_list(l):
      l[1] = 17

  l = [1, 2, 3]
  modify_list(l)
  print(l)
#+END_SRC 

#+RESULTS:
: [1, 17, 3]


** Ergebnisse transportieren -- Beispiel 

#+BEGIN_SRC python :exports both :results output
  def verdopple(l):
      """Verdopple das erste Element der Liste"""
      l[0] = l[0] + l[0]

  l = [3, 4, 5]
  verdopple(l)
  print(l)
  l = ["ab", 7, 8]
  verdopple(l)
  print(l)
#+END_SRC 

#+RESULTS:
: [6, 4, 5]
: ['abab', 7, 8]


*** Von Tuple zu Liste 

#+BEGIN_SRC python :exports both :results output
T = ('a', 'b', 'c' ) 
L = list(T)
print(L)
#+END_SRC 

#+RESULTS:
: ['a', 'b', 'c']

*** Von Liste zu Tuple 

#+BEGIN_SRC python :exports both :results output
L = ['a', 'b', 'c']
T = tuple(L)
print(T)
#+END_SRC 

#+RESULTS:
: ('a', 'b', 'c')


**  Operationen auf Mengen 

- Wie üblich: Schnitt, Vereinigung, Differenz
- Konvertierung von Listen und Tuples 
- Test auf enthalten-sein: ~in~

#+BEGIN_SRC python :exports both :results output
a = set( (1,2,3,4,3,2))
print(a)
print(2 in a)
print(5 in a)
#+END_SRC 

#+RESULTS:
: {1, 2, 3, 4}
: True
: False

*** Ein leeres ~dict~: geschweifte Klammern 

#+BEGIN_SRC python :exports both :results output
D = {}
print(D)
#+END_SRC 

#+RESULTS:
: {}


** ~dict~: Werte angeben, Kurznotation 

Da ~dict~ sehr häufig  vorkommen gibt es eine Kurznotation,
ähnlich zur Definition von Mengen
- In gescheiften Klammern, die Schlüssel/Wert-Paaren aufzählen, mit
  Komma getrennt 
- Schlüssel und Wert durch Doppelpunkt getrennt
- Entspricht der Ausgabe eines ~dict~ durch ~print~

#+BEGIN_SRC python :exports both :results output
D = {"a": 17, "x": "Hallo"}
print(D) 
#+END_SRC 

#+RESULTS:
: {'x': 'Hallo', 'a': 17}


** ~dict~: Werte angeben 

- Alternative: An Funktion ~dict~ eine Liste von 2-Tupeln übergeben 
  - Jedes Tupel: Schlüssel, dann zugeordneter Wert
  - Liefert entsprechendes ~dict~
- Diese Darstellung entspricht gut der internen Darstellung eines
  ~dict~
- Unterschied: Kurznotation oft praktisch einzutippen; diese Notation
  oft praktisch zur Verarbeitung von Ergebnissen 


#+BEGIN_SRC python :exports both :results output
D = dict([("a", 17), ("x", "hallo")])
#+END_SRC 

#+RESULTS:
: {'x': 'hallo', 'a': 17}


** 'dict' Test auf enthalten-sein 

Analog zu ~set~: Mit ~in~ testen 


#+BEGIN_SRC python :exports both :results output
D = {}
D['a'] = 1
print('a' in D)
print('b' in D) 
#+END_SRC 

#+RESULTS:
: True
: False


** Operation auf ~dict~

Reichhaltige Operationen auf ~dicts~: 

- ~len(D)~: Anzahl der Einträge
- ~D.keys()~: Liste aller Schlüssel
- ~D.values()~: Liste aller eingetragenen Werte 
- ~D.items()~: Liste von Tupeln der vorhandenen Schlüssel/Wert-Paare 

#+BEGIN_SRC python :exports both :results output
# Was liefert das hier? 
# D ein beliebiges dict 
D = dict([ ("a", 17), ("x", "hallo")])
print("D als Liste Schluessel/Wert: ", D.items())
D1 = dict(D.items())
print("Aus Liste wieder ein dict: ", D1)
#+END_SRC 

#+RESULTS:
: D als Liste Schluessel/Wert:  dict_items([('a', 17), ('x', 'hallo')])
: Aus Liste wieder ein dict:  {'a': 17, 'x': 'hallo'}



